LoadTesting/scripts/getAnnotationsForUserBook_All_500.txt
Running 5m test
  2 threads and 10 connections
  Thread calibration: mean lat.: 8.465ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 11.474ms, rate sampling interval: 17ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.31ms   33.67ms 643.58ms   96.17%
    Req/Sec   260.64    159.97     2.56k    88.16%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.56ms
 75.000%    2.98ms
 90.000%    4.11ms
 99.000%  164.86ms
 99.900%  495.10ms
 99.990%  597.50ms
 99.999%  632.32ms
100.000%  644.09ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.342     0.000000            1         1.00
       1.935     0.100000        14499         1.11
       2.129     0.200000        29058         1.25
       2.281     0.300000        43575         1.43
       2.419     0.400000        58072         1.67
       2.555     0.500000        72451         2.00
       2.623     0.550000        79753         2.22
       2.695     0.600000        86977         2.50
       2.773     0.650000        94208         2.86
       2.865     0.700000       101418         3.33
       2.979     0.750000       108680         4.00
       3.045     0.775000       112269         4.44
       3.127     0.800000       115883         5.00
       3.229     0.825000       119474         5.71
       3.375     0.850000       123092         6.67
       3.599     0.875000       126718         8.00
       3.797     0.887500       128508         8.89
       4.115     0.900000       130326        10.00
       4.747     0.912500       132127        11.43
       5.939     0.925000       133940        13.33
       8.767     0.937500       135749        16.00
      11.943     0.943750       136651        17.78
      19.455     0.950000       137556        20.00
      30.239     0.956250       138461        22.86
      43.775     0.962500       139367        26.67
      60.415     0.968750       140273        32.00
      70.079     0.971875       140724        35.56
      80.255     0.975000       141176        40.00
      92.543     0.978125       141628        45.71
     106.751     0.981250       142082        53.33
     123.839     0.984375       142535        64.00
     132.991     0.985938       142759        71.11
     143.999     0.987500       142987        80.00
     156.287     0.989062       143214        91.43
     171.135     0.990625       143439       106.67
     186.879     0.992188       143664       128.00
     196.479     0.992969       143779       142.22
     208.511     0.993750       143891       160.00
     221.183     0.994531       144006       182.86
     236.287     0.995313       144117       213.33
     257.023     0.996094       144230       256.00
     269.567     0.996484       144286       284.44
     283.903     0.996875       144343       320.00
     308.991     0.997266       144400       365.71
     335.103     0.997656       144456       426.67
     378.367     0.998047       144513       512.00
     399.103     0.998242       144541       568.89
     425.215     0.998437       144569       640.00
     450.815     0.998633       144598       731.43
     475.647     0.998828       144626       853.33
     500.479     0.999023       144654      1024.00
     509.439     0.999121       144668      1137.78
     521.983     0.999219       144682      1280.00
     535.039     0.999316       144697      1462.86
     544.767     0.999414       144711      1706.67
     555.007     0.999512       144725      2048.00
     560.639     0.999561       144732      2275.56
     564.223     0.999609       144739      2560.00
     570.367     0.999658       144746      2925.71
     577.023     0.999707       144753      3413.33
     581.631     0.999756       144761      4096.00
     585.215     0.999780       144764      4551.11
     587.263     0.999805       144767      5120.00
     592.895     0.999829       144771      5851.43
     595.455     0.999854       144776      6826.67
     596.479     0.999878       144779      8192.00
     596.991     0.999890       144780      9102.22
     597.503     0.999902       144781     10240.00
     600.575     0.999915       144783     11702.86
     602.623     0.999927       144786     13653.33
     605.695     0.999939       144787     16384.00
     608.767     0.999945       144788     18204.44
     608.767     0.999951       144788     20480.00
     610.815     0.999957       144789     23405.71
     611.839     0.999963       144790     27306.67
     614.399     0.999969       144791     32768.00
     617.983     0.999973       144792     36408.89
     617.983     0.999976       144792     40960.00
     617.983     0.999979       144792     46811.43
     626.687     0.999982       144793     54613.33
     626.687     0.999985       144793     65536.00
     632.319     0.999986       144794     72817.78
     632.319     0.999988       144794     81920.00
     632.319     0.999989       144794     93622.86
     632.319     0.999991       144794    109226.67
     632.319     0.999992       144794    131072.00
     644.095     0.999993       144795    145635.56
     644.095     1.000000       144795          inf
#[Mean    =        8.311, StdDeviation   =       33.672]
#[Max     =      643.584, Total count    =       144795]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  149763 requests in 4.99m, 22.85MB read
Requests/sec:    500.31
Transfer/sec:     78.17KB