LoadTesting/scripts/getAnnotationsForUserBook_All_750.txt
Running 5m test
  2 threads and 10 connections
  Thread calibration: mean lat.: 22.976ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 22.653ms, rate sampling interval: 11ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   223.54ms  495.63ms   3.59s    88.09%
    Req/Sec   391.92    420.43     2.70k    93.25%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.76ms
 75.000%  156.03ms
 90.000%  839.17ms
 99.000%    2.34s 
 99.900%    3.39s 
 99.990%    3.57s 
 99.999%    3.59s 
100.000%    3.60s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.287     0.000000            1         1.00
       1.870     0.100000        21733         1.11
       2.109     0.200000        43487         1.25
       2.315     0.300000        65196         1.43
       2.519     0.400000        86921         1.67
       2.757     0.500000       108687         2.00
       2.919     0.550000       119460         2.22
       3.167     0.600000       130341         2.50
       3.925     0.650000       141179         2.86
      21.935     0.700000       152029         3.33
     156.031     0.750000       162889         4.00
     234.495     0.775000       168317         4.44
     320.511     0.800000       173750         5.00
     424.959     0.825000       179186         5.71
     549.887     0.850000       184610         6.67
     685.567     0.875000       190055         8.00
     759.807     0.887500       192761         8.89
     839.167     0.900000       195477        10.00
     931.839     0.912500       198181        11.43
    1035.775     0.925000       200903        13.33
    1154.047     0.937500       203612        16.00
    1223.679     0.943750       204974        17.78
    1318.911     0.950000       206325        20.00
    1430.527     0.956250       207688        22.86
    1539.071     0.962500       209041        26.67
    1658.879     0.968750       210403        32.00
    1724.415     0.971875       211084        35.56
    1808.383     0.975000       211761        40.00
    1895.423     0.978125       212433        45.71
    1989.631     0.981250       213111        53.33
    2091.007     0.984375       213796        64.00
    2154.495     0.985938       214136        71.11
    2224.127     0.987500       214471        80.00
    2295.807     0.989062       214809        91.43
    2365.439     0.990625       215153       106.67
    2467.839     0.992188       215488       128.00
    2527.231     0.992969       215657       142.22
    2609.151     0.993750       215831       160.00
    2686.975     0.994531       215998       182.86
    2772.991     0.995313       216168       213.33
    2856.959     0.996094       216336       256.00
    2899.967     0.996484       216425       284.44
    2942.975     0.996875       216507       320.00
    3014.655     0.997266       216594       365.71
    3092.479     0.997656       216674       426.67
    3176.447     0.998047       216760       512.00
    3219.455     0.998242       216804       568.89
    3262.463     0.998437       216844       640.00
    3309.567     0.998633       216892       731.43
    3350.527     0.998828       216929       853.33
    3389.439     0.999023       216972      1024.00
    3411.967     0.999121       216995      1137.78
    3432.447     0.999219       217015      1280.00
    3450.879     0.999316       217035      1462.86
    3471.359     0.999414       217056      1706.67
    3493.887     0.999512       217080      2048.00
    3504.127     0.999561       217089      2275.56
    3514.367     0.999609       217100      2560.00
    3524.607     0.999658       217111      2925.71
    3534.847     0.999707       217120      3413.33
    3545.087     0.999756       217132      4096.00
    3551.231     0.999780       217139      4551.11
    3555.327     0.999805       217142      5120.00
    3557.375     0.999829       217146      5851.43
    3565.567     0.999854       217153      6826.67
    3569.663     0.999878       217158      8192.00
    3571.711     0.999890       217160      9102.22
    3575.807     0.999902       217164     10240.00
    3577.855     0.999915       217166     11702.86
    3579.903     0.999927       217168     13653.33
    3581.951     0.999939       217171     16384.00
    3583.999     0.999945       217172     18204.44
    3586.047     0.999951       217173     20480.00
    3588.095     0.999957       217176     23405.71
    3588.095     0.999963       217176     27306.67
    3590.143     0.999969       217178     32768.00
    3590.143     0.999973       217178     36408.89
    3590.143     0.999976       217178     40960.00
    3592.191     0.999979       217182     46811.43
    3592.191     0.999982       217182     54613.33
    3592.191     0.999985       217182     65536.00
    3592.191     0.999986       217182     72817.78
    3592.191     0.999988       217182     81920.00
    3592.191     0.999989       217182     93622.86
    3592.191     0.999991       217182    109226.67
    3592.191     0.999992       217182    131072.00
    3592.191     0.999993       217182    145635.56
    3592.191     0.999994       217182    163840.00
    3592.191     0.999995       217182    187245.71
    3596.287     0.999995       217183    218453.33
    3596.287     1.000000       217183          inf
#[Mean    =      223.538, StdDeviation   =      495.634]
#[Max     =     3594.240, Total count    =       217183]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  224699 requests in 4.99m, 34.29MB read
  Socket errors: connect 0, read 0, write 0, timeout 12
Requests/sec:    750.34
Transfer/sec:    117.24KB